Revit 2024 API
BoundingBoxContainsPointFilter Constructor (XYZ, Boolean)
 Constructs a new instance of a filter to match elements with a bounding box that contains the given point, with the option to invert the filter and match all elements with a bounding box that do not contain the given point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public BoundingBoxContainsPointFilter(
	XYZ point,
	bool inverted
)
Visual Basic
Public Sub New ( _
	point As XYZ, _
	inverted As Boolean _
)
Visual C++
public:
BoundingBoxContainsPointFilter(
	XYZ^ point,
	bool inverted
)
Parameters
point
Type: Autodesk.Revit.DB.XYZ
 The point used to find elements with a bounding box containing it.
inverted
Type: System.Boolean
 True if the filter should be inverted and match all elements with a bounding box that do not contain the given point.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BoundingBoxContainsPointFilter Class
BoundingBoxContainsPointFilter Overload
Autodesk.Revit.DB Namespace